GrumpyOldPizza/ArduinoCore-stm32l0/boards.txt
IRNAS-env-module-L072Z.upload.tool=stm32l0_openocd
IRNAS-env-module-L072Z.upload.protocol=stlink
IRNAS-env-module-L072Z.upload.maximum_size=196608
IRNAS-env-module-L072Z.upload.maximum_data_size=20480
IRNAS-env-module-L072Z.upload.use_1200bps_touch=true
IRNAS-env-module-L072Z.upload.wait_for_upload_port=false
IRNAS-env-module-L072Z.upload.native_usb=false

IRNAS-env-module-L072Z.build.mcu=cortex-m0plus
IRNAS-env-module-L072Z.build.f_cpu=32000000L
IRNAS-env-module-L072Z.build.board=STM32L0_B_L072Z_LRWAN1
IRNAS-env-module-L072Z.build.arch=stm32l0
IRNAS-env-module-L072Z.build.core=arduino
IRNAS-env-module-L072Z.build.vid=0x0483
IRNAS-env-module-L072Z.build.pid=0x374b
IRNAS-env-module-L072Z.build.did=0xffff
IRNAS-env-module-L072Z.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
IRNAS-env-module-L072Z.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
IRNAS-env-module-L072Z.build.openocdscript=openocd_scripts/IRNAS-env-module-L072Z.cfg
IRNAS-env-module-L072Z.build.variant=IRNAS-env-module-L072Z
IRNAS-env-module-L072Z.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
IRNAS-env-module-L072Z.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

IRNAS-env-module-L072Z.menu.speed.32=32 MHz
IRNAS-env-module-L072Z.menu.speed.32.build.f_cpu=32000000L
IRNAS-env-module-L072Z.menu.speed.16=16 MHz (No USB)
IRNAS-env-module-L072Z.menu.speed.16.build.f_cpu=16000000L
IRNAS-env-module-L072Z.menu.speed.4=4.2 MHz (No USB)
IRNAS-env-module-L072Z.menu.speed.4.build.f_cpu=4200000L

IRNAS-env-module-L072Z.menu.opt.os=Smallest Code
IRNAS-env-module-L072Z.menu.opt.os.build.flags.optimize=-Os
IRNAS-env-module-L072Z.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
IRNAS-env-module-L072Z.menu.opt.o1=Fast
IRNAS-env-module-L072Z.menu.opt.o1.build.flags.optimize=-O1
IRNAS-env-module-L072Z.menu.opt.o1.build.flags.ldspecs=
IRNAS-env-module-L072Z.menu.opt.o2=Faster
IRNAS-env-module-L072Z.menu.opt.o2.build.flags.optimize=-O2
IRNAS-env-module-L072Z.menu.opt.o2.build.flags.ldspecs=
IRNAS-env-module-L072Z.menu.opt.o3=Fastest
IRNAS-env-module-L072Z.menu.opt.o3.build.flags.optimize=-O3
IRNAS-env-module-L072Z.menu.opt.o3.build.flags.ldspecs=

# Tlera Gnat
# ---------------------------------------
Gnat-L082CZ.name=Gnat-L082CZ
Gnat-L082CZ.vid.0=0x1209
Gnat-L082CZ.pid.0=0x6662

Gnat-L082CZ.upload.tool=stm32l0_dfu
Gnat-L082CZ.upload.protocol=dfu
Gnat-L082CZ.upload.maximum_size=196608
Gnat-L082CZ.upload.maximum_data_size=20480
Gnat-L082CZ.upload.use_1200bps_touch=true
Gnat-L082CZ.upload.wait_for_upload_port=false
Gnat-L082CZ.upload.native_usb=false

Gnat-L082CZ.build.mcu=cortex-m0plus
Gnat-L082CZ.build.f_cpu=32000000L
Gnat-L082CZ.build.board=STM32L0_GNAT
Gnat-L082CZ.build.arch=stm32l0
Gnat-L082CZ.build.core=arduino
Gnat-L082CZ.build.vid=0x1209
Gnat-L082CZ.build.pid=0x6662
Gnat-L082CZ.build.did=0xffff
Gnat-L082CZ.build.usb_manufacturer="Tlera Corporation"
Gnat-L082CZ.build.usb_product="Gnat"
Gnat-L082CZ.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags}
Gnat-L082CZ.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
Gnat-L082CZ.build.openocdscript=openocd_scripts/gnat-l082cz.cfg
Gnat-L082CZ.build.variant=Gnat-L082CZ
Gnat-L082CZ.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
Gnat-L082CZ.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

Gnat-L082CZ.menu.usb.cdc=Serial
Gnat-L082CZ.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Gnat-L082CZ.menu.usb.cdc_hid=Serial + Keyboard + Mouse
Gnat-L082CZ.menu.usb.cdc_hid.build.usb_type=USB_TYPE_CDC_HID
Gnat-L082CZ.menu.usb.none=No USB
Gnat-L082CZ.menu.usb.none.build.usb_type=USB_TYPE_NONE

Gnat-L082CZ.menu.speed.32=32 MHz
Gnat-L082CZ.menu.speed.32.build.f_cpu=32000000L
Gnat-L082CZ.menu.speed.16=16 MHz (No USB)
Gnat-L082CZ.menu.speed.16.build.f_cpu=16000000L
Gnat-L082CZ.menu.speed.4=4.2 MHz (No USB)
Gnat-L082CZ.menu.speed.4.build.f_cpu=4200000L

Gnat-L082CZ.menu.opt.os=Smallest Code
Gnat-L082CZ.menu.opt.os.build.flags.optimize=-Os
Gnat-L082CZ.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Gnat-L082CZ.menu.opt.o1=Fast
Gnat-L082CZ.menu.opt.o1.build.flags.optimize=-O1
Gnat-L082CZ.menu.opt.o1.build.flags.ldspecs=
Gnat-L082CZ.menu.opt.o2=Faster
Gnat-L082CZ.menu.opt.o2.build.flags.optimize=-O2
Gnat-L082CZ.menu.opt.o2.build.flags.ldspecs=
Gnat-L082CZ.menu.opt.o3=Fastest
Gnat-L082CZ.menu.opt.o3.build.flags.optimize=-O3
Gnat-L082CZ.menu.opt.o3.build.flags.ldspecs=


# ST B-L072Z-LRWAN1
# ---------------------------------------
B-L072Z-LRWAN1.name=B-L072Z-LRWAN1
B-L072Z-LRWAN1.vid.0=0x0483
B-L072Z-LRWAN1.pid.0=0x374b

B-L072Z-LRWAN1.upload.tool=stm32l0_openocd
B-L072Z-LRWAN1.upload.protocol=stlink
B-L072Z-LRWAN1.upload.maximum_size=196608
B-L072Z-LRWAN1.upload.maximum_data_size=20480
B-L072Z-LRWAN1.upload.use_1200bps_touch=true
B-L072Z-LRWAN1.upload.wait_for_upload_port=false
B-L072Z-LRWAN1.upload.native_usb=false

B-L072Z-LRWAN1.build.mcu=cortex-m0plus
B-L072Z-LRWAN1.build.f_cpu=32000000L
B-L072Z-LRWAN1.build.board=STM32L0_B_L072Z_LRWAN1
B-L072Z-LRWAN1.build.arch=stm32l0
B-L072Z-LRWAN1.build.core=arduino
B-L072Z-LRWAN1.build.vid=0x0483
B-L072Z-LRWAN1.build.pid=0x374b
B-L072Z-LRWAN1.build.did=0xffff
B-L072Z-LRWAN1.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
B-L072Z-LRWAN1.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
B-L072Z-LRWAN1.build.openocdscript=openocd_scripts/b-l072z-lrwan1.cfg
B-L072Z-LRWAN1.build.variant=B-L072Z-LRWAN1
B-L072Z-LRWAN1.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
B-L072Z-LRWAN1.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

B-L072Z-LRWAN1.menu.speed.32=32 MHz
B-L072Z-LRWAN1.menu.speed.32.build.f_cpu=32000000L
B-L072Z-LRWAN1.menu.speed.16=16 MHz (No USB)
B-L072Z-LRWAN1.menu.speed.16.build.f_cpu=16000000L
B-L072Z-LRWAN1.menu.speed.4=4.2 MHz (No USB)
B-L072Z-LRWAN1.menu.speed.4.build.f_cpu=4200000L

